7Robot/Eurobot-2013/Pince_dsPIC33F.X/main.c
/*
* Template dsPIC33F
* Compiler : Microchip xC16
* µC : 33FJ64MC802
* Juillet 2012
*    ____________      _           _
*   |___  /| ___ \    | |         | |
*      / / | |_/ /___ | |__   ___ | |_
*     / /  |    // _ \| '_ \ / _ \| __|
*    / /   | |\ \ (_) | |_) | (_) | |_
*   /_/    |_| \_\___/|____/ \___/'\__|
*			      7robot.fr
*/

#include <p33Fxxxx.h>      /* Includes device header file                     */
#include <stdint.h>        /* Includes uint16_t definition                    */
#include <stdbool.h>       /* Includes true/false definition                  */
#include "header.h"        /* Function / Parameters                           */
#include <libpic30.h>
#include <uart.h>
#include "ax12.h"

/******************************************************************************/
/* Global Variable Declaration                                                */
/******************************************************************************/

/* i.e. uint16_t <variable_name>; */


/******************************************************************************/
/* Configuartion                                                              */
/******************************************************************************/

// Select Oscillator and switching.
_FOSCSEL(FNOSC_FRCPLL & IESO_OFF);
// Select clock.
_FOSC(POSCMD_NONE & OSCIOFNC_ON & IOL1WAY_OFF & FCKSM_CSDCMD);
// Watchdog Timer.
_FWDT(FWDTEN_OFF);
// Select debug channel.
_FICD(ICS_PGD1 & JTAGEN_OFF);

/******************************************************************************/
/* Main Program                                                               */
/******************************************************************************/

int16_t main(void)
{

    // Initialize IO ports and peripherals.
    ConfigureOscillator();
    InitApp();
    responseReadyAX = 0;

    ODCBbits.ODCB5 = 1;

    __delay_ms(10);
    PutAX(AX_BROADCAST, AX_MOVING_SPEED, 250);
    __delay_ms(10);
    PutAX(AX_BROADCAST, AX_MAX_TORQUE, 1100);
    __delay_ms(10);

    while(1) {

        //Cinematique_inverse();
        //0->BD, 1->HD, 2->HD1, 3->HD2, 4->HG1, 5->HG2
        __delay_ms(1000);

        //Serrer un verre en position basse :
		PutAX(AX_BG, AX_GOAL_POSITION, 845);
        __delay_ms(10);
        PutAX(AX_BD, AX_GOAL_POSITION, 170);
        __delay_ms(400);
        PutAX(AX_BG, AX_GOAL_POSITION, 800);
        __delay_ms(10);
        PutAX(AX_BD, AX_GOAL_POSITION, 220);
        __delay_ms(200);
        PutAX(AX_BG, AX_GOAL_POSITION, 845);
        __delay_ms(10);
        PutAX(AX_BD, AX_GOAL_POSITION, 170);
        __delay_ms(10);

        __delay_ms(300);

        //Serrer la pince stockage
        PutAX(AX_HD1, AX_GOAL_POSITION, 273);
        __delay_ms(10);
        PutAX(AX_HD2, AX_GOAL_POSITION, 622);
        __delay_ms(10);
        PutAX(AX_HG1, AX_GOAL_POSITION, 738);
        __delay_ms(10);
        PutAX(AX_HG2, AX_GOAL_POSITION, 371);
        __delay_ms(10);

        __delay_ms(3000);

        //Ouvrir pince en position basse :
        PutAX(AX_BG, AX_GOAL_POSITION, 710);
        __delay_ms(10);
        PutAX(AX_BD, AX_GOAL_POSITION, 310);
        __delay_ms(400);


    }
}


